# Superstore Sales Workflow Tutorial

This notebook walks through cleaning the Superstore dataset, designing a relational structure, creating an SQLite database, and running example SQL queries and visualizations.

In [1]:
import pandas as pd
import sqlite3
import matplotlib.pyplot as plt
import seaborn as sns
import matplotlib.ticker as mticker

## 1️) Load and Inspect the Dataset

In [2]:
# reading error codes + research is how you can learn if there is different encoding, as seen below
df = pd.read_csv('../data/Superstore.csv', encoding='ISO-8859-1')
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,Segment,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,09-11-2013,12-11-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2013-152156,09-11-2013,12-11-2013,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2013-138688,13-06-2013,17-06-2013,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2012-108966,11-10-2012,18-10-2012,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2012-108966,11-10-2012,18-10-2012,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

### Double check some datatypes, and for nulls and duplicates:

In [3]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 9994 entries, 0 to 9993
Data columns (total 21 columns):
 #   Column         Non-Null Count  Dtype
---  ------         --------------  -----
 0   Row ID         9994 non-null   int64
 1   Order ID       9994 non-null   object
 2   Order Date     9994 non-null   object
 3   Ship Date      9994 non-null   object
 4   Ship Mode      9994 non-null   object
 5   Customer ID    9994 non-null   object
 6   Customer Name  9994 non-null   object
 7   Segment        9994 non-null   object
 8   Country        9994 non-null   object
 9   City           9994 non-null   object
 10  State          9994 non-null   object
 11  Postal Code    9994 non-null   int64
 12  Region         9994 non-null   object
 13  Product ID     9994 non-null   object
 14  Category       9994 non-null   object
 15  Sub-Category   9994 non-null   object
 16  Product Name   9994 non-null   object
 17  Sales          9994 non-null   float64
 18  Quantity       9994 non-null   int64
 19  Discount       9994 non-null   float64
 20  Profit         9994 non-null   float64
dtypes: float64(3), int64(3), object(15)
memory usage: 1.6+ MB

In [5]:
df.duplicated().sum()

np.int64(0)

In [4]:
df.isnull().sum()

Row ID           0
Order ID         0
Order Date       0
Ship Date        0
Ship Mode        0
Customer ID      0
Customer Name    0
Segment          0
Country          0
City             0
State            0
Postal Code      0
Region           0
Product ID       0
Category         0
Sub-Category     0
Product Name     0
Sales            0
Quantity         0
Discount         0
Profit           0
dtype: int64

This data is incredibly clean - we can see there are no null values and no duplicates. However, there are some dates that could be saved in a better format.

## 2) Data Cleaning

In [3]:
df['Order Date'] = pd.to_datetime(df['Order Date'], dayfirst=True)
df['Ship Date'] = pd.to_datetime(df['Ship Date'], dayfirst=True)

In [7]:
df.dtypes

Row ID                    int64
Order ID                 object
Order Date       datetime64[ns]
Ship Date        datetime64[ns]
Ship Mode                object
Customer ID              object
Customer Name            object
Segment                  object
Country                  object
City                     object
State                    object
Postal Code               int64
Region                   object
Product ID               object
Category                 object
Sub-Category             object
Product Name             object
Sales                   float64
Quantity                  int64
Discount                float64
Profit                  float64
dtype: object

In [7]:
df.Segment.unique()

array(['Consumer', 'Corporate', 'Home Office'], dtype=object)

In [8]:
df.rename(columns={"Segment":"customer_category"}, inplace=True)
df.head()

,Row ID,Order ID,Order Date,Ship Date,Ship Mode,Customer ID,Customer Name,customer_category,Country,City,...,Postal Code,Region,Product ID,Category,Sub-Category,Product Name,Sales,Quantity,Discount,Profit
0,1,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-BO-10001798,Furniture,Bookcases,Bush Somerset Collection Bookcase,261.9600,2,0.00,41.9136
1,2,CA-2013-152156,2013-11-09,2013-11-12,Second Class,CG-12520,Claire Gute,Consumer,United States,Henderson,...,42420,South,FUR-CH-10000454,Furniture,Chairs,"Hon Deluxe Fabric Upholstered Stacking Chairs,...",731.9400,3,0.00,219.5820
2,3,CA-2013-138688,2013-06-13,2013-06-17,Second Class,DV-13045,Darrin Van Huff,Corporate,United States,Los Angeles,...,90036,West,OFF-LA-10000240,Office Supplies,Labels,Self-Adhesive Address Labels for Typewriters b...,14.6200,2,0.00,6.8714
3,4,US-2012-108966,2012-10-11,2012-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,FUR-TA-10000577,Furniture,Tables,Bretford CR4500 Series Slim Rectangular Table,957.5775,5,0.45,-383.0310
4,5,US-2012-108966,2012-10-11,2012-10-18,Standard Class,SO-20335,Sean O'Donnell,Consumer,United States,Fort Lauderdale,...,33311,South,OFF-ST-10000760,Office Supplies,Storage,Eldon Fold 'N Roll Cart System,22.3680,2,0.20,2.5164

With real data, it is very likely more cleaning and wrangling would be required.

## 3) Build Relational Tables

In [9]:
conn = sqlite3.connect('../data/superstore.db')

customers_df = df[['Customer ID','Customer Name','customer_category','City','State','Region']].drop_duplicates().rename(columns={
    'Customer ID':'customer_id',
    'Customer Name':'customer_name',
    'City':'city',
    'State':'state',
    'Region':'region'
})

products_df = df[['Product ID','Category','Sub-Category','Product Name']].drop_duplicates().rename(columns={
    'Product ID':'product_id',
    'Category':'category',
    'Sub-Category':'subcategory',
    'Product Name':'product_name'
})

orders_df = df[['Order ID','Order Date','Ship Date','Ship Mode','Customer ID']].drop_duplicates().rename(columns={
    'Order ID':'order_id',
    'Order Date':'order_date',
    'Ship Date':'ship_date',
    'Ship Mode':'ship_mode',
    'Customer ID':'customer_id'
})

order_details_df = df[['Order ID','Product ID','Sales','Quantity','Discount','Profit']].rename(columns={
    'Order ID':'order_id',
    'Product ID':'product_id'
})

customers_df.to_sql('customers', conn, index=False, if_exists='replace')
products_df.to_sql('products', conn, index=False, if_exists='replace')
orders_df.to_sql('orders', conn, index=False, if_exists='replace')
order_details_df.to_sql('order_details', conn, index=False, if_exists='replace')
conn.commit()

## 4) Make Some Queries!

### Which customer segments bring in the most revenue and profit?

In [10]:
query1 = """ SELECT 
    c.customer_category,
    ROUND(SUM(od.sales), 2) AS total_sales,
    ROUND(SUM(od.profit), 2) AS total_profit
FROM order_details od
JOIN orders o ON od.order_id = o.order_id
JOIN customers c ON o.customer_id = c.customer_id
GROUP BY c.customer_category
ORDER BY total_sales DESC;
"""
result1 = pd.read_sql(query1, conn)
result1

  customer_category  total_sales  total_profit
0          Consumer   7954360.98     923657.52
1         Corporate   4768494.07     622614.73
2       Home Office   2808676.56     403920.45

### What are the top 10 customers by total sales?

In [11]:
query2 = """
SELECT c.customer_id, c.customer_name, SUM(od.sales) as total_sales
FROM customers as c
JOIN orders as o on o.customer_id = c.customer_id
JOIN order_details as od on od.order_id = o.order_id
GROUP BY c.customer_id, c.customer_name
ORDER BY total_sales DESC
LIMIT 10;
 """
result2 = pd.read_sql(query2, conn)
result2

  customer_id     customer_name  total_sales
0    KL-16645      Ken Lonsdale   141752.290
1    SE-20110      Sanjit Engle   134303.818
2    AB-10105     Adrian Barton   130262.139
3    SM-20320       Sean Miller   125215.250
4    CL-12565       Clay Ludtke   119686.006
5    SC-20095      Sanjit Chand   113138.672
6    SV-20365       Seth Vernon   103238.550
7    ZC-21910  Zuschuss Carroll    96308.484
8    ME-17320     Maria Etezadi    95973.552
9    LA-16780   Laura Armstrong    95405.442

### Which product categories and subcategories are the most profitable overall?

In [15]:
query3 = """
SELECT p.category, p.subcategory, SUM(od.profit) as total_profit
FROM products as p
JOIN order_details as od on od.product_id = p.product_id
GROUP BY p.category, p.subcategory
ORDER BY total_profit desc
LIMIT 10;
"""
result3 = pd.read_sql(query3, conn)
result3

          category  subcategory  total_profit
0       Technology      Copiers    55617.8249
1       Technology  Accessories    48359.0527
2       Technology       Phones    46936.1861
3  Office Supplies        Paper    36994.5335
4  Office Supplies      Binders    30373.2020
5        Furniture       Chairs    26707.6526
6  Office Supplies      Storage    21408.7032
7  Office Supplies   Appliances    18514.4928
8        Furniture  Furnishings    14569.5873
9  Office Supplies    Envelopes     6964.1767

### What is the average discount given per category?

In [17]:
query4 = """
SELECT p.category, AVG(od.discount) as avg_discount FROM products as p
JOIN order_details as od on od.product_id = p.product_id
GROUP BY p.category;
"""
result4 = pd.read_sql(query4, conn)
result4

          category  avg_discount
0        Furniture      0.172514
1  Office Supplies      0.157000
2       Technology      0.132970

### Which states or regions contribute the most to total sales?

In [20]:
query5 = """
SELECT c.state, c.region, SUM(od.sales) as total_sales
FROM customers as c
LEFT JOIN orders as o on o.customer_id = c.customer_id
Left JOIN order_details as od on od.order_id = o.order_id
GROUP BY c.state, c.region
ORDER BY total_sales DESC;
"""
result5 = pd.read_sql(query5, conn)
result5

                   state   region   total_sales
0             California     West  2.991944e+06
1               New York     East  1.572500e+06
2                  Texas  Central  1.495331e+06
3           Pennsylvania     East  8.142799e+05
4               Illinois  Central  7.977212e+05
5             Washington     West  7.839997e+05
6                   Ohio     East  7.077477e+05
7                Florida    South  6.356378e+05
8         North Carolina    South  4.379384e+05
9               Michigan  Central  4.324280e+05
10              Virginia    South  4.039472e+05
11               Arizona     West  3.329282e+05
12             Tennessee    South  2.706262e+05
13               Georgia    South  2.678956e+05
14               Indiana  Central  2.649128e+05
15              Colorado     West  2.546810e+05
16         Massachusetts     East  2.219293e+05
17                Oregon     West  2.124425e+05
18              Kentucky    South  2.052866e+05
19            New Jersey     East  1.969393e+05
20             Wisconsin  Central  1.860757e+05
21              Delaware     East  1.753409e+05
22             Minnesota  Central  1.683877e+05
23               Alabama    South  1.430410e+05
24              Maryland     East  1.315468e+05
25           Connecticut     East  1.284140e+05
26              Oklahoma  Central  1.012231e+05
27                  Utah     West  1.002923e+05
28              Arkansas    South  9.515870e+04
29          Rhode Island     East  9.244737e+04
30                Nevada     West  9.051994e+04
31        South Carolina    South  8.610077e+04
32           Mississippi    South  8.574048e+04
33              Missouri  Central  8.320677e+04
34             Louisiana    South  7.506477e+04
35              Nebraska  Central  7.065040e+04
36            New Mexico     West  6.248433e+04
37                  Iowa  Central  5.997377e+04
38         New Hampshire     East  5.971961e+04
39                Kansas  Central  5.888731e+04
40                 Idaho     West  5.298387e+04
41          South Dakota  Central  3.055457e+04
42               Montana     West  2.060037e+04
43               Vermont     East  1.836844e+04
44                 Maine     East  1.823970e+04
45  District of Columbia     East  1.542031e+04
46         West Virginia     East  1.140548e+04
47          North Dakota  Central  6.113262e+03
48               Wyoming     West  2.453284e+03

### How many orders were shipped late (where Ship Date > Order Date + 3 days)?

In [32]:
query6 = """ 
SELECT count(*) as count FROM Orders
WHERE ship_date > order_date + 3;
"""
result6 = pd.read_sql(query6, conn)
result6

   count
0   5009

### Which month or year had the highest total sales?

In [ ]:
query7 = """ Your code here! """
result7 = pd.read_sql(query7, conn)
result7

### What are the most frequently ordered products?

In [ ]:
query8 = """ Your code here! """
result8 = pd.read_sql(query8, conn)
result8

### Which customers placed more than 5 orders total?

In [ ]:
query9 = """ Your code here! """
result9 = pd.read_sql(query9, conn)
result9

### What’s the profit margin (profit ÷ sales) by category or segment?

In [ ]:
query10 = """ Your code here! """
result10 = pd.read_sql(query10, conn)
result10

### 5) Visualize it!

From your ten results, select at least 4 to utilize in a meaningful visualization.

In [ ]:
# example using result1
plt.figure(figsize=(10,6))
colors = ["#a7adaa", "#a7adaa", "#f74141" ]
sns.barplot(result1, x='customer_category', y='total_sales', palette=colors, hue='customer_category', legend=False)
plt.title('Small Offices, Smaller Sales: The Home Office Gap',fontsize=18)
plt.xlabel(None)
plt.ylabel('Total Sales ($USD)')

#for those wondering how to get rid of scientific notation! Set style to plain:
plt.ticklabel_format(style='plain', axis='y')

#mticker is a great library for helping tick mark formatting, such as adding commas and dollar signs in this case
ax = plt.gca()
ax.yaxis.set_major_formatter(mticker.FuncFormatter(lambda x, _: f'${x:,.0f}'))

#using the seaborn library, despining is way easier!
sns.despine()
plt.show()

In [ ]:
# visualization one code here

In [ ]:
# visualization two code here

In [ ]:
# visualization three code here

In [ ]:
# visualization four code here